Reports/ИА_ФинансоваяДирективаЛист3.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ИА_ФинансоваяДирективаЛист3</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ФинансовоеПланирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ИА_ЗаказыНаПриобретение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_ЗаказыНаПриобретение</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ИА_ИсторияСтатусовЗВС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ИсторияСтатусовЗВС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_СостояниеЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗВС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаявкаНаОбязательства</v8:Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ИА_СредстваВРезервеНаФондах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_СредстваВРезервеНаФондах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ИА_ВидДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ВидДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_СостояниеЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_СостояниеЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденРуководителем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненРуководителем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассмотретьНаФП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_НетВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_ЧастичныеВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_ВсёВыплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_НетВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_ЧастичныеВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_ВсёВыплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносНаСледующееФП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИА_Фонды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_Фонды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтображатьВСписке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьРасходВМинус</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Защищенный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ИА_ФинансоваяДирективаЛист3/Forms/ФормаОтчетаУпр/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьТаблицуЗП(поТекДокументу = Истина)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодЗапрос.Заказ,
	               |	ПодЗапрос.Фонд КАК Фонд,
	               |	ПодЗапрос.ПредметЗаказа,
	               |	ВЫБОР
	               |		КОГДА ПодЗапрос.Заказ.ВидДС = ЗНАЧЕНИЕ(Перечисление.ИА_ВидДенежныхСредств.Наличные)
	               |			ТОГДА ПодЗапрос.Сумма - ЕСТЬNULL(ПодЗапросРезервы.Сумма, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаНал,
	               |	ВЫБОР
	               |		КОГДА ПодЗапрос.Заказ.ВидДС <> ЗНАЧЕНИЕ(Перечисление.ИА_ВидДенежныхСредств.Наличные)
	               |			ТОГДА ПодЗапрос.Сумма - ЕСТЬNULL(ПодЗапросРезервы.Сумма, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаБезнал,
	               |	0 КАК Сумма,
	               |	ПодЗапрос.Статус,
	               |	ПодЗапрос.УтвержденнаяСумма КАК УтвержденнаяСумма,
	               |	0 КАК ИсходнаяСумма,
	               |	ПодЗапрос.ПричинаОтказа,
	               |	ПодЗапрос.НачислениеВФондНал КАК НачислениеВФондНал,
	               |	ПодЗапрос.НачислениеВФондБезнал КАК НачислениеВФондБезнал,
	               |	0 КАК НачислениеВФонд,
	               |	ПодЗапрос.Подразделение КАК Подразделение,
	               |	ПодЗапрос.Подразделение.Наименование КАК ПодразделениеФонд
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЗаказыНаПриобретение.Заказ КАК Заказ,
	               |		ЗаказыНаПриобретение.Заказ.Фонд КАК Фонд,
	               |		ЗаказыНаПриобретение.Заказ.Подразделение КАК Подразделение,
	               |		ЗаказыНаПриобретение.Заказ.ПредметЗаказа КАК ПредметЗаказа,
	               |		ЗаказыНаПриобретение.Заказ.Сумма КАК Сумма,
	               |		ЗаказыНаПриобретение.Статус КАК Статус,
	               |		ЗаказыНаПриобретение.УтвержденнаяСумма КАК УтвержденнаяСумма,
	               |		ЗаказыНаПриобретение.ПричинаОтказа КАК ПричинаОтказа,
	               |		0 КАК НачислениеВФондНал,
	               |		0 КАК НачислениеВФондБезнал
	               |	ИЗ
	               |		Документ.ИА_ФинансовоеПланирование.ЗаказыНаПриобретение КАК ЗаказыНаПриобретение
	               |	ГДЕ
	               |		ЗаказыНаПриобретение.Ссылка = &ТекДок
	               |		И &ПоТекДоку = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ЗНАЧЕНИЕ(Документ.ИА_ЗаказНаПриобретение.ПустаяСсылка),
	               |		НачисленияВФонды.Фонд,
	               |		НачисленияВФонды.Подразделение,
	               |		"""",
	               |		0,
	               |		NULL,
	               |		0,
	               |		"""",
	               |		СУММА(НачисленияВФонды.СуммаНал),
	               |		СУММА(НачисленияВФонды.СуммаБезнал)
	               |	ИЗ
	               |		Документ.ИА_ФинансовоеПланирование.НачисленияВФонды КАК НачисленияВФонды
	               |	ГДЕ
	               |		НачисленияВФонды.Ссылка = &ТекДок
	               |		И &ПоТекДоку = ИСТИНА
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		НачисленияВФонды.Фонд,
	               |		НачисленияВФонды.Подразделение
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ЗаявкиНаРасходованиеСредствОстатки.ЗП,
	               |		ЗаявкиНаРасходованиеСредствОстатки.ЗП.Фонд,
	               |		ЗаявкиНаРасходованиеСредствОстатки.ЗП.Подразделение,
	               |		ЗаявкиНаРасходованиеСредствОстатки.ЗП.ПредметЗаказа,
	               |		ЗаявкиНаРасходованиеСредствОстатки.ЗП.Сумма,
	               |		ИА_ИсторияСтатусовЗВССрезПоследних.Статус,
	               |		0,
	               |		ВЫРАЗИТЬ("""" КАК СТРОКА(100)),
	               |		0,
	               |		0
	               |	ИЗ
	               |		РегистрНакопления.ИА_ЗаказыНаПриобретение.Остатки(
	               |				&Дата,
	               |				Организация = &Организация
	               |					ИЛИ &НеРазделять) КАК ЗаявкиНаРасходованиеСредствОстатки
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ИсторияСтатусовЗВС.СрезПоследних КАК ИА_ИсторияСтатусовЗВССрезПоследних
	               |			ПО ЗаявкиНаРасходованиеСредствОстатки.ЗП = ИА_ИсторияСтатусовЗВССрезПоследних.ЗВС
	               |	ГДЕ
	               |		ЗаявкиНаРасходованиеСредствОстатки.ЗП.Статус <> &Отклонен
	               |		И &ПоТекДоку = ЛОЖЬ
	               |		И ЗаявкиНаРасходованиеСредствОстатки.СуммаОстаток > 0) КАК ПодЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ИА_СредстваВРезервеНаФондахОбороты.ЗП КАК Ссылка,
	               |			СУММА(ИА_СредстваВРезервеНаФондахОбороты.СуммаНалПриход) + СУММА(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналПриход) КАК Сумма
	               |		ИЗ
	               |			РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(, , Регистратор, ) КАК ИА_СредстваВРезервеНаФондахОбороты
	               |		ГДЕ
	               |			ИА_СредстваВРезервеНаФондахОбороты.Регистратор <> &ТекДок
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ИА_СредстваВРезервеНаФондахОбороты.ЗП) КАК ПодЗапросРезервы
	               |		ПО ПодЗапрос.Заказ = ПодЗапросРезервы.Ссылка
	               |ГДЕ
	               |	(ПодЗапрос.Сумма - ЕСТЬNULL(ПодЗапросРезервы.Сумма, 0) > 0
	               |			ИЛИ ПодЗапрос.НачислениеВФондНал + ПодЗапрос.НачислениеВФондБезнал > 0)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПодЗапрос.Фонд.Код
	               |ИТОГИ
	               |	СУММА(СуммаНал),
	               |	СУММА(СуммаБезнал),
	               |	СУММА(УтвержденнаяСумма),
	               |	МАКСИМУМ(НачислениеВФондНал),
	               |	МАКСИМУМ(НачислениеВФондБезнал)
	               |ПО
	               |	Подразделение,
	               |	Фонд";
	Запрос.УстановитьПараметр("Дата", КонецДня(Отчет.СсылкаНаОбъект.Дата));
	Запрос.УстановитьПараметр("ТекДок", Отчет.СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ПоТекДоку", поТекДокументу);
	Запрос.УстановитьПараметр("Организация", Отчет.СсылкаНаОбъект.Организация);
	Запрос.УстановитьПараметр("НеРазделять", не Константы.ИА_ФП_ВестиФППоОрганизациям.Получить());
	Запрос.УстановитьПараметр("Отклонен", Перечисления.ИА_СостояниеЗаказа.Отклонен);
	
	//Минаев
	ДеревоЗПЗнач = ДанныеФормыВЗначение(ЭтаФорма.ДеревоЗП,Тип("ДеревоЗначений"));
	ДеревоЗПЗнач = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// добавление пустых фондов
	ВыборкаФондовСпр = Справочники.ИА_Фонды.Выбрать();
	Пока ВыборкаФондовСпр.Следующий() Цикл 
		Если ВыборкаФондовСпр.ЭтоГруппа или не ВыборкаФондовСпр.ОтображатьВСписке Тогда
			Продолжить;
		КонецЕсли;
		
		ТЗ_Подр = ВыборкаФондовСпр.Подразделения.Выгрузить();
		ТЗ_Подр.Свернуть("Подразделение");
		
		Для каждого стрПодрФ из ТЗ_Подр Цикл
			СтрокаПодр = ДеревоЗПЗнач.Строки.Найти(стрПодрФ.Подразделение, "Подразделение");
			Если СтрокаПодр = Неопределено Тогда // такого подр нет
				НовстрПодр = ДеревоЗПЗнач.Строки.Добавить();
				НовстрПодр.Подразделение = стрПодрФ.Подразделение;
				НовстрПодр.СуммаНал = 0;
				НовстрПодр.СуммаБезнал = 0;
				НовстрПодр.НачислениеВФондНал = 0;
				НовстрПодр.НачислениеВФондБезнал = 0;
				
				НовстрФонд = НовстрПодр.Строки.Добавить();
				НовстрФонд.Подразделение = стрПодрФ.Подразделение;
				НовстрФонд.Фонд = ВыборкаФондовСпр.Ссылка;
				НовстрФонд.СуммаНал = 0;
				НовстрФонд.СуммаБезнал = 0;
				НовстрФонд.НачислениеВФондНал = 0;
				НовстрФонд.НачислениеВФондБезнал = 0;
			Иначе // есть подр
				СтрокаФонд = СтрокаПодр.Строки.Найти(ВыборкаФондовСпр.Ссылка, "Фонд");
				Если СтрокаФонд = Неопределено Тогда
					НовстрФонд = СтрокаПодр.Строки.Добавить();
					НовстрФонд.Подразделение = стрПодрФ.Подразделение;
					НовстрФонд.Фонд = ВыборкаФондовСпр.Ссылка;
					НовстрФонд.СуммаНал = 0;
					НовстрФонд.СуммаБезнал = 0;
					НовстрФонд.НачислениеВФондНал = 0;
					НовстрФонд.НачислениеВФондБезнал = 0;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если поТекДокументу Тогда
		Для каждого СтрПодр из ДеревоЗПЗнач.Строки Цикл
			Для каждого стрФонд из СтрПодр.Строки Цикл
				сч = стрФонд.Строки.Количество() - 1;
				Пока сч >= 0 Цикл
					стрЗап = стрФонд.Строки[сч];
					Если не ЗначениеЗаполнено(стрЗап.Заказ) Тогда
						стрФонд.Строки.Удалить(сч);
					иначе
						стрЗап.НачислениеВФондНал = 0;
						стрЗап.НачислениеВФондБезнал = 0;
					КонецЕсли;
					сч = сч - 1;
			 	КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ДеревоЗПЗнач.Строки.Сортировать("Подразделение");
	//Минаев
	ЗначениеВДанныеФормы(ДеревоЗПЗнач,ЭтаФорма.ДеревоЗП);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечать(Команда)
	ЗаполнитьТаблицуЗП();
	ТабДок = ЗаполнитьТабДок();
    ТабДок.Показать();
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТабДок()
	// Вставить содержимое обработчика.
	ЭтотОбъект = РеквизитФормыВЗначение("Отчет");
	ДеревоЗПЗнач = ДанныеФормыВЗначение(ДеревоЗП,тип("ДеревоЗначений"));
    ТабДок = ЭтотОбъект.Печать(ДеревоЗПЗнач);
	Возврат ТабДок;	
КонецФункции
